Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz1025dag169.h
#define _IPC15_ADCD1IP_POSITION                  0x00000002
#define _IPC15_ADCD1IP_MASK                      0x0000001C
#define _IPC15_ADCD1IP_LENGTH                    0x00000003

#define _IPC15_ADCD2IS_POSITION                  0x00000008
#define _IPC15_ADCD2IS_MASK                      0x00000300
#define _IPC15_ADCD2IS_LENGTH                    0x00000002

#define _IPC15_ADCD2IP_POSITION                  0x0000000A
#define _IPC15_ADCD2IP_MASK                      0x00001C00
#define _IPC15_ADCD2IP_LENGTH                    0x00000003

#define _IPC15_ADCD3IS_POSITION                  0x00000010
#define _IPC15_ADCD3IS_MASK                      0x00030000
#define _IPC15_ADCD3IS_LENGTH                    0x00000002

#define _IPC15_ADCD3IP_POSITION                  0x00000012
#define _IPC15_ADCD3IP_MASK                      0x001C0000
#define _IPC15_ADCD3IP_LENGTH                    0x00000003

#define _IPC15_ADCD4IS_POSITION                  0x00000018
#define _IPC15_ADCD4IS_MASK                      0x03000000
#define _IPC15_ADCD4IS_LENGTH                    0x00000002

#define _IPC15_ADCD4IP_POSITION                  0x0000001A
#define _IPC15_ADCD4IP_MASK                      0x1C000000
#define _IPC15_ADCD4IP_LENGTH                    0x00000003

#define _IPC15_w_POSITION                        0x00000000
#define _IPC15_w_MASK                            0xFFFFFFFF
#define _IPC15_w_LENGTH                          0x00000020

#define _IPC16_ADCD5IS_POSITION                  0x00000000
#define _IPC16_ADCD5IS_MASK                      0x00000003
#define _IPC16_ADCD5IS_LENGTH                    0x00000002

#define _IPC16_ADCD5IP_POSITION                  0x00000002
#define _IPC16_ADCD5IP_MASK                      0x0000001C
#define _IPC16_ADCD5IP_LENGTH                    0x00000003

#define _IPC16_ADCD6IS_POSITION                  0x00000008
#define _IPC16_ADCD6IS_MASK                      0x00000300
#define _IPC16_ADCD6IS_LENGTH                    0x00000002

#define _IPC16_ADCD6IP_POSITION                  0x0000000A
#define _IPC16_ADCD6IP_MASK                      0x00001C00
#define _IPC16_ADCD6IP_LENGTH                    0x00000003

#define _IPC16_ADCD7IS_POSITION                  0x00000010
#define _IPC16_ADCD7IS_MASK                      0x00030000
#define _IPC16_ADCD7IS_LENGTH                    0x00000002

#define _IPC16_ADCD7IP_POSITION                  0x00000012
#define _IPC16_ADCD7IP_MASK                      0x001C0000
#define _IPC16_ADCD7IP_LENGTH                    0x00000003

#define _IPC16_ADCD8IS_POSITION                  0x00000018
#define _IPC16_ADCD8IS_MASK                      0x03000000
#define _IPC16_ADCD8IS_LENGTH                    0x00000002

#define _IPC16_ADCD8IP_POSITION                  0x0000001A
#define _IPC16_ADCD8IP_MASK                      0x1C000000
#define _IPC16_ADCD8IP_LENGTH                    0x00000003

#define _IPC16_w_POSITION                        0x00000000
#define _IPC16_w_MASK                            0xFFFFFFFF
#define _IPC16_w_LENGTH                          0x00000020

#define _IPC17_ADCD9IS_POSITION                  0x00000000
#define _IPC17_ADCD9IS_MASK                      0x00000003
#define _IPC17_ADCD9IS_LENGTH                    0x00000002

#define _IPC17_ADCD9IP_POSITION                  0x00000002
#define _IPC17_ADCD9IP_MASK                      0x0000001C
#define _IPC17_ADCD9IP_LENGTH                    0x00000003

#define _IPC17_ADCD10IS_POSITION                 0x00000008
#define _IPC17_ADCD10IS_MASK                     0x00000300
#define _IPC17_ADCD10IS_LENGTH                   0x00000002

#define _IPC17_ADCD10IP_POSITION                 0x0000000A
#define _IPC17_ADCD10IP_MASK                     0x00001C00
#define _IPC17_ADCD10IP_LENGTH                   0x00000003

#define _IPC17_ADCD11IS_POSITION                 0x00000010
#define _IPC17_ADCD11IS_MASK                     0x00030000
#define _IPC17_ADCD11IS_LENGTH                   0x00000002

#define _IPC17_ADCD11IP_POSITION                 0x00000012
#define _IPC17_ADCD11IP_MASK                     0x001C0000
#define _IPC17_ADCD11IP_LENGTH                   0x00000003

#define _IPC17_ADCD12IS_POSITION                 0x00000018
#define _IPC17_ADCD12IS_MASK                     0x03000000
#define _IPC17_ADCD12IS_LENGTH                   0x00000002

#define _IPC17_ADCD12IP_POSITION                 0x0000001A
#define _IPC17_ADCD12IP_MASK                     0x1C000000
#define _IPC17_ADCD12IP_LENGTH                   0x00000003

#define _IPC17_w_POSITION                        0x00000000
#define _IPC17_w_MASK                            0xFFFFFFFF
#define _IPC17_w_LENGTH                          0x00000020

#define _IPC18_ADCD13IS_POSITION                 0x00000000
#define _IPC18_ADCD13IS_MASK                     0x00000003
#define _IPC18_ADCD13IS_LENGTH                   0x00000002

#define _IPC18_ADCD13IP_POSITION                 0x00000002
#define _IPC18_ADCD13IP_MASK                     0x0000001C
#define _IPC18_ADCD13IP_LENGTH                   0x00000003

#define _IPC18_ADCD14IS_POSITION                 0x00000008
#define _IPC18_ADCD14IS_MASK                     0x00000300
#define _IPC18_ADCD14IS_LENGTH                   0x00000002

#define _IPC18_ADCD14IP_POSITION                 0x0000000A
#define _IPC18_ADCD14IP_MASK                     0x00001C00
#define _IPC18_ADCD14IP_LENGTH                   0x00000003

#define _IPC18_ADCD15IS_POSITION                 0x00000010
#define _IPC18_ADCD15IS_MASK                     0x00030000
#define _IPC18_ADCD15IS_LENGTH                   0x00000002

#define _IPC18_ADCD15IP_POSITION                 0x00000012
#define _IPC18_ADCD15IP_MASK                     0x001C0000
#define _IPC18_ADCD15IP_LENGTH                   0x00000003

#define _IPC18_ADCD16IS_POSITION                 0x00000018
#define _IPC18_ADCD16IS_MASK                     0x03000000
#define _IPC18_ADCD16IS_LENGTH                   0x00000002

#define _IPC18_ADCD16IP_POSITION                 0x0000001A
#define _IPC18_ADCD16IP_MASK                     0x1C000000
#define _IPC18_ADCD16IP_LENGTH                   0x00000003

