Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz1025dag169.h
#define _ADCCMPEN2_CMPE4_POSITION                0x00000004
#define _ADCCMPEN2_CMPE4_MASK                    0x00000010
#define _ADCCMPEN2_CMPE4_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE5_POSITION                0x00000005
#define _ADCCMPEN2_CMPE5_MASK                    0x00000020
#define _ADCCMPEN2_CMPE5_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE6_POSITION                0x00000006
#define _ADCCMPEN2_CMPE6_MASK                    0x00000040
#define _ADCCMPEN2_CMPE6_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE7_POSITION                0x00000007
#define _ADCCMPEN2_CMPE7_MASK                    0x00000080
#define _ADCCMPEN2_CMPE7_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE8_POSITION                0x00000008
#define _ADCCMPEN2_CMPE8_MASK                    0x00000100
#define _ADCCMPEN2_CMPE8_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE9_POSITION                0x00000009
#define _ADCCMPEN2_CMPE9_MASK                    0x00000200
#define _ADCCMPEN2_CMPE9_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE10_POSITION               0x0000000A
#define _ADCCMPEN2_CMPE10_MASK                   0x00000400
#define _ADCCMPEN2_CMPE10_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE11_POSITION               0x0000000B
#define _ADCCMPEN2_CMPE11_MASK                   0x00000800
#define _ADCCMPEN2_CMPE11_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE12_POSITION               0x0000000C
#define _ADCCMPEN2_CMPE12_MASK                   0x00001000
#define _ADCCMPEN2_CMPE12_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE13_POSITION               0x0000000D
#define _ADCCMPEN2_CMPE13_MASK                   0x00002000
#define _ADCCMPEN2_CMPE13_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE14_POSITION               0x0000000E
#define _ADCCMPEN2_CMPE14_MASK                   0x00004000
#define _ADCCMPEN2_CMPE14_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE15_POSITION               0x0000000F
#define _ADCCMPEN2_CMPE15_MASK                   0x00008000
#define _ADCCMPEN2_CMPE15_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE16_POSITION               0x00000010
#define _ADCCMPEN2_CMPE16_MASK                   0x00010000
#define _ADCCMPEN2_CMPE16_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE17_POSITION               0x00000011
#define _ADCCMPEN2_CMPE17_MASK                   0x00020000
#define _ADCCMPEN2_CMPE17_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE18_POSITION               0x00000012
#define _ADCCMPEN2_CMPE18_MASK                   0x00040000
#define _ADCCMPEN2_CMPE18_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE19_POSITION               0x00000013
#define _ADCCMPEN2_CMPE19_MASK                   0x00080000
#define _ADCCMPEN2_CMPE19_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE20_POSITION               0x00000014
#define _ADCCMPEN2_CMPE20_MASK                   0x00100000
#define _ADCCMPEN2_CMPE20_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE21_POSITION               0x00000015
#define _ADCCMPEN2_CMPE21_MASK                   0x00200000
#define _ADCCMPEN2_CMPE21_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE22_POSITION               0x00000016
#define _ADCCMPEN2_CMPE22_MASK                   0x00400000
#define _ADCCMPEN2_CMPE22_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE23_POSITION               0x00000017
#define _ADCCMPEN2_CMPE23_MASK                   0x00800000
#define _ADCCMPEN2_CMPE23_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE24_POSITION               0x00000018
#define _ADCCMPEN2_CMPE24_MASK                   0x01000000
#define _ADCCMPEN2_CMPE24_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE25_POSITION               0x00000019
#define _ADCCMPEN2_CMPE25_MASK                   0x02000000
#define _ADCCMPEN2_CMPE25_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE26_POSITION               0x0000001A
#define _ADCCMPEN2_CMPE26_MASK                   0x04000000
#define _ADCCMPEN2_CMPE26_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE27_POSITION               0x0000001B
#define _ADCCMPEN2_CMPE27_MASK                   0x08000000
#define _ADCCMPEN2_CMPE27_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE28_POSITION               0x0000001C
#define _ADCCMPEN2_CMPE28_MASK                   0x10000000
#define _ADCCMPEN2_CMPE28_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE29_POSITION               0x0000001D
#define _ADCCMPEN2_CMPE29_MASK                   0x20000000
#define _ADCCMPEN2_CMPE29_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE30_POSITION               0x0000001E
#define _ADCCMPEN2_CMPE30_MASK                   0x40000000
#define _ADCCMPEN2_CMPE30_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE31_POSITION               0x0000001F
#define _ADCCMPEN2_CMPE31_MASK                   0x80000000
#define _ADCCMPEN2_CMPE31_LENGTH                 0x00000001

#define _ADCCMP2_DCMPLO_POSITION                 0x00000000
#define _ADCCMP2_DCMPLO_MASK                     0x0000FFFF
#define _ADCCMP2_DCMPLO_LENGTH                   0x00000010

#define _ADCCMP2_DCMPHI_POSITION                 0x00000010
#define _ADCCMP2_DCMPHI_MASK                     0xFFFF0000
#define _ADCCMP2_DCMPHI_LENGTH                   0x00000010

#define _ADCCMPEN3_CMPE0_POSITION                0x00000000
#define _ADCCMPEN3_CMPE0_MASK                    0x00000001
#define _ADCCMPEN3_CMPE0_LENGTH                  0x00000001

#define _ADCCMPEN3_CMPE1_POSITION                0x00000001
#define _ADCCMPEN3_CMPE1_MASK                    0x00000002
#define _ADCCMPEN3_CMPE1_LENGTH                  0x00000001

#define _ADCCMPEN3_CMPE2_POSITION                0x00000002
#define _ADCCMPEN3_CMPE2_MASK                    0x00000004
#define _ADCCMPEN3_CMPE2_LENGTH                  0x00000001

#define _ADCCMPEN3_CMPE3_POSITION                0x00000003
#define _ADCCMPEN3_CMPE3_MASK                    0x00000008
#define _ADCCMPEN3_CMPE3_LENGTH                  0x00000001

#define _ADCCMPEN3_CMPE4_POSITION                0x00000004
#define _ADCCMPEN3_CMPE4_MASK                    0x00000010
#define _ADCCMPEN3_CMPE4_LENGTH                  0x00000001

#define _ADCCMPEN3_CMPE5_POSITION                0x00000005
#define _ADCCMPEN3_CMPE5_MASK                    0x00000020
#define _ADCCMPEN3_CMPE5_LENGTH                  0x00000001

#define _ADCCMPEN3_CMPE6_POSITION                0x00000006
#define _ADCCMPEN3_CMPE6_MASK                    0x00000040
#define _ADCCMPEN3_CMPE6_LENGTH                  0x00000001

#define _ADCCMPEN3_CMPE7_POSITION                0x00000007
#define _ADCCMPEN3_CMPE7_MASK                    0x00000080
#define _ADCCMPEN3_CMPE7_LENGTH                  0x00000001

