Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz1025dag169.h
#define _ADCDATA28_DATA_POSITION                 0x00000000
#define _ADCDATA28_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA28_DATA_LENGTH                   0x00000020

#define _ADCDATA29_DATA_POSITION                 0x00000000
#define _ADCDATA29_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA29_DATA_LENGTH                   0x00000020

#define _ADCDATA30_DATA_POSITION                 0x00000000
#define _ADCDATA30_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA30_DATA_LENGTH                   0x00000020

#define _ADCDATA31_DATA_POSITION                 0x00000000
#define _ADCDATA31_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA31_DATA_LENGTH                   0x00000020

#define _ADCDATA32_DATA_POSITION                 0x00000000
#define _ADCDATA32_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA32_DATA_LENGTH                   0x00000020

#define _ADCDATA33_DATA_POSITION                 0x00000000
#define _ADCDATA33_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA33_DATA_LENGTH                   0x00000020

#define _ADCDATA34_DATA_POSITION                 0x00000000
#define _ADCDATA34_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA34_DATA_LENGTH                   0x00000020

#define _ADCDATA35_DATA_POSITION                 0x00000000
#define _ADCDATA35_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA35_DATA_LENGTH                   0x00000020

#define _ADCDATA36_DATA_POSITION                 0x00000000
#define _ADCDATA36_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA36_DATA_LENGTH                   0x00000020

#define _ADCDATA37_DATA_POSITION                 0x00000000
#define _ADCDATA37_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA37_DATA_LENGTH                   0x00000020

#define _ADCDATA38_DATA_POSITION                 0x00000000
#define _ADCDATA38_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA38_DATA_LENGTH                   0x00000020

#define _ADCDATA39_DATA_POSITION                 0x00000000
#define _ADCDATA39_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA39_DATA_LENGTH                   0x00000020

#define _ADCDATA40_DATA_POSITION                 0x00000000
#define _ADCDATA40_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA40_DATA_LENGTH                   0x00000020

#define _ADCDATA41_DATA_POSITION                 0x00000000
#define _ADCDATA41_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA41_DATA_LENGTH                   0x00000020

#define _ADCDATA42_DATA_POSITION                 0x00000000
#define _ADCDATA42_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA42_DATA_LENGTH                   0x00000020

#define _ADCDATA43_DATA_POSITION                 0x00000000
#define _ADCDATA43_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA43_DATA_LENGTH                   0x00000020

#define _CM1CON_CCH_POSITION                     0x00000000
#define _CM1CON_CCH_MASK                         0x00000003
#define _CM1CON_CCH_LENGTH                       0x00000002

#define _CM1CON_CREF_POSITION                    0x00000004
#define _CM1CON_CREF_MASK                        0x00000010
#define _CM1CON_CREF_LENGTH                      0x00000001

#define _CM1CON_EVPOL_POSITION                   0x00000006
#define _CM1CON_EVPOL_MASK                       0x000000C0
#define _CM1CON_EVPOL_LENGTH                     0x00000002

#define _CM1CON_COUT_POSITION                    0x00000008
#define _CM1CON_COUT_MASK                        0x00000100
#define _CM1CON_COUT_LENGTH                      0x00000001

#define _CM1CON_CPOL_POSITION                    0x0000000D
#define _CM1CON_CPOL_MASK                        0x00002000
#define _CM1CON_CPOL_LENGTH                      0x00000001

#define _CM1CON_COE_POSITION                     0x0000000E
#define _CM1CON_COE_MASK                         0x00004000
#define _CM1CON_COE_LENGTH                       0x00000001

#define _CM1CON_ON_POSITION                      0x0000000F
#define _CM1CON_ON_MASK                          0x00008000
#define _CM1CON_ON_LENGTH                        0x00000001

#define _CM1CON_CCH0_POSITION                    0x00000000
#define _CM1CON_CCH0_MASK                        0x00000001
#define _CM1CON_CCH0_LENGTH                      0x00000001

#define _CM1CON_CCH1_POSITION                    0x00000001
#define _CM1CON_CCH1_MASK                        0x00000002
#define _CM1CON_CCH1_LENGTH                      0x00000001

#define _CM1CON_EVPOL0_POSITION                  0x00000006
#define _CM1CON_EVPOL0_MASK                      0x00000040
#define _CM1CON_EVPOL0_LENGTH                    0x00000001

#define _CM1CON_EVPOL1_POSITION                  0x00000007
#define _CM1CON_EVPOL1_MASK                      0x00000080
#define _CM1CON_EVPOL1_LENGTH                    0x00000001

#define _CM1CON_w_POSITION                       0x00000000
#define _CM1CON_w_MASK                           0xFFFFFFFF
#define _CM1CON_w_LENGTH                         0x00000020

#define _CM2CON_CCH_POSITION                     0x00000000
#define _CM2CON_CCH_MASK                         0x00000003
#define _CM2CON_CCH_LENGTH                       0x00000002

#define _CM2CON_CREF_POSITION                    0x00000004
#define _CM2CON_CREF_MASK                        0x00000010
#define _CM2CON_CREF_LENGTH                      0x00000001

#define _CM2CON_EVPOL_POSITION                   0x00000006
#define _CM2CON_EVPOL_MASK                       0x000000C0
#define _CM2CON_EVPOL_LENGTH                     0x00000002

#define _CM2CON_COUT_POSITION                    0x00000008
#define _CM2CON_COUT_MASK                        0x00000100
#define _CM2CON_COUT_LENGTH                      0x00000001

#define _CM2CON_CPOL_POSITION                    0x0000000D
#define _CM2CON_CPOL_MASK                        0x00002000
#define _CM2CON_CPOL_LENGTH                      0x00000001

#define _CM2CON_COE_POSITION                     0x0000000E
#define _CM2CON_COE_MASK                         0x00004000
#define _CM2CON_COE_LENGTH                       0x00000001

#define _CM2CON_ON_POSITION                      0x0000000F
#define _CM2CON_ON_MASK                          0x00008000
#define _CM2CON_ON_LENGTH                        0x00000001

#define _CM2CON_CCH0_POSITION                    0x00000000
#define _CM2CON_CCH0_MASK                        0x00000001
#define _CM2CON_CCH0_LENGTH                      0x00000001

#define _CM2CON_CCH1_POSITION                    0x00000001
#define _CM2CON_CCH1_MASK                        0x00000002
#define _CM2CON_CCH1_LENGTH                      0x00000001

#define _CM2CON_EVPOL0_POSITION                  0x00000006
#define _CM2CON_EVPOL0_MASK                      0x00000040
#define _CM2CON_EVPOL0_LENGTH                    0x00000001

#define _CM2CON_EVPOL1_POSITION                  0x00000007
#define _CM2CON_EVPOL1_MASK                      0x00000080
#define _CM2CON_EVPOL1_LENGTH                    0x00000001

